Repository: pingfangx/TranslatorX-other
Catalog: GitDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: You almost certainly want to direct into a file (e.g., GIT_TRACE_PACKFILE=/tmp/my.pack) rather than displaying it on the terminal or mixing it with other trace output.
zh_cn: 您几乎肯定要直接进入文件(例如， GIT_TRACE_PACKFILE=/tmp/my.pack )，而不是将其显示在终端上或与其他跟踪输出进行混合。

source: You also could say c or clean above as long as the choice is unique.
zh_cn: 只要选择是唯一的，您也可以说 c 或 clean 。

source: You also could say s or sta or status above as long as the choice is unique.
zh_cn: 只要选择是唯一的，您也可以说 s 或 sta 或 status 。

source: You are free to make arbitrary changes to the patch, but note that some changes may have confusing results, or even result in a patch that cannot be applied.
zh_cn: 您可以随意对修补程序进行任意更改，但请注意，某些更改可能会导致混乱的结果，甚至导致无法应用的修补程序。

source: You can also have a similar effect without committing by using git add -u.
zh_cn: 您也可以使用 git add -u 来不提交就有相似的效果。

source: You can give the -m flag to the command, which would try a three-way merge:
zh_cn: 您可以将 -m 标志指定给该命令，这将尝试三向合并：

source: You can input space-separated patterns to exclude files and directories from deletion.
zh_cn: 您可以输入空格分隔的模式，以排除删除的文件和目录。

source: You can learn more about individual Git commands with "git help command".
zh_cn: 您可以使用 “git help command” 了解有关单个 Git 命令的更多信息。

source: You can leave out at most one of A and B, in which case it defaults to HEAD.
zh_cn: 您最多可以省略 A 和 B ，默认为 HEAD 。

source: You can make interesting things happen to a repository every time you push into it, by setting up hooks there.
zh_cn: 你可以通过在这里设置 hooks ，在每次推送一个仓库时都执行有趣的事情。

source: You can omit any one of <commit>, which has the same effect as using HEAD instead.
zh_cn: 您可以省略任何一个<commit>，这与使用 HEAD 有相同的效果。

source: You can omit having to type return here, by setting the configuration variable interactive.singleKey to true.
zh_cn: 通过将配置变量 interactive.singleKey 设置为 true ，可以省略输入返回。

source: You can omit the --no-index option when running the command in a working tree controlled by Git and at least one of the paths points outside the working tree, or when running the command outside a working tree controlled by Git.
zh_cn: 在由 Git 控制的工作树中运行命令时，可以省略 --no-index 选项，并且至少有一个路径指向工作树之外，或者在工作树之外运行命令时由 Git 控制。

source: You can override these rules either by command-line options or by environment variables.
zh_cn: 您可以通过命令行选项或环境变量覆盖这些规则。

source: You can prevent staging any addition lines by deleting them.
zh_cn: 删除它们可以防止暂存任何添加行。

source: You can prevent staging the modification by converting "-" lines to " ", and removing "+" lines.
zh_cn: 您可以通过将“ - ”行转换为 " "，并删除“+”行来防止进行修改。

source: You can prevent staging their removal by converting the "-" to a " " (space).
zh_cn: 您可以通过将 “-” 转为 " " (空格)来防止其移除。

source: You can query/set/replace/unset options with this command.
zh_cn: 你可以使用此命令 查询/设置/更换/取消 选项。

source: You can reorder the commits, and you can remove them (weeding out bad or otherwise unwanted patches).
zh_cn: 您可以重新排序提交，您可以移除它们(除去坏的或不需要的补丁)。

source: You can say * to choose everything.
zh_cn: 您可以说 * 选择所有内容。

source: You can select one of the following options and type return:
zh_cn: 您可以选择以下选项之一并键入 return：

source: You can stage context lines for removal by converting the space to a "-".
zh_cn: 您可以通过将空格转换为"-"来排列要删除的上下文行。

source: You can stage these changes by using git-add[1].
zh_cn: 您可以使用 git-add[1] 来暂存这些更改。

source: You can use git diff to locate the markers (<<<<<<) and make edits to resolve the conflict.
zh_cn: 您可以使用 git diff 找到标记(<<<<<<)并进行编辑以解决冲突。

source: You can use HEAD to compare it with the latest commit, or a branch name to compare with the tip of a different branch.
zh_cn: 您可以使用 HEAD 将其与最新的提交进行比较，或分支名称以与不同分支的提示进行比较。

source: You can use the @ construct with an empty ref part to get at a reflog entry of the current branch.
zh_cn: 您可以使用具有空引用部分的 @ 结构来获取当前分支的 reflog 条目。

source: You can use this hook to do sanity checks and reject the rebase if it isn’t appropriate.
zh_cn: 您可以使用此钩子进行健全检查，如果不合适可拒绝 rebase。

source: You could omit <branch>, in which case the command degenerates to "check out the current branch", which is a glorified no-op with a rather expensive side-effects to show only the tracking information, if exists, for the current branch.
zh_cn: 您可以省略<branch>，在这种情况下，命令退化为"检出当前分支"，这是一个有非常昂贵的副作用的 glorified no-op ，用于显示当前分支的跟踪信息（如果存在） 。

source: You could use this as a back-up method.
zh_cn: 您可以将其用作备份方法。

source: You do not have to be subscribed to the list to send a message there.
zh_cn: 您不必订阅该列表即可在那里发送消息。

source: You may also add new content that does not exist in the patch; simply add new lines, each starting with "+".
zh_cn: 您还可以添加补丁中不存在的新内容;只需添加新行，每行以"+"开头。

source: You may also specify - which is synonymous with "@{-1}".
zh_cn: 您也可以指定与 "@{-1}" 同义的 - 。

source: You may override individual configuration parameters when running any git command by using the -c option.
zh_cn: 使用 -c 选项运行任何 git 命令时，可以覆盖单个配置参数。

source: You may specify more than one branch for deletion.
zh_cn: 您可以指定多个分支进行删除。

source: You might want this if you are feeding literal paths to Git (e.g., paths previously given to you by git ls-tree, --raw diff output, etc).
zh_cn: 如果您正在向 Git 提供文字路径（如之前由 git ls-tree ，--raw diff 输出等提供给您的路径），您可能需要这样做。

source: You should instead write:
zh_cn: 你应该写：

source: You should not need to set it yourself unless you want to be paranoid about making sure an operation has touched every ref (e.g., because you are cloning a repository to make a backup).
zh_cn: 您不需要自己设置，除非您想要确保操作是否已触及每个引用(例如，因为您正在克隆仓库进行备份)。

source: You should refrain from abusing this option to sneak substantial changes into a merge commit.
zh_cn: 您不应该滥用此选项来将大量更改潜入到合并提交中。

source: You should understand the implications of rewriting history if you amend a commit that has already been published.
zh_cn: 如果您修改已发布的提交，您应该了解重写历史记录的含义。

source: You should understand the implications of using git rebase on a repository that you share.
zh_cn: 您应该了解在您共享的仓库中使用 git rebase 的含义。

source: You use it by first telling it a "bad" commit that is known to contain the bug, and a "good" commit that is known to be before the bug was introduced.
zh_cn: 要使用它，首先告诉它一个已知包含该错误的“bad”提交，以及在引入错误之前已知的“good”提交。

source: You will have to resolve any such merge failure and run git rebase --continue.
zh_cn: 您将必须解决任何此类合并失败，然后运行 git rebase --continue 。

source: You would have to first check which paths are conflicting with git status and after fixing them manually in your working tree, you would stage the result as usual with git add:
zh_cn: 您必须首先用 git status 检查哪些路径有冲突，并在手动将其在工作树中修复之后，您将像往常一样使用 git add 暂存结果：

source: a file in the $GIT_DIR/branches directory.
zh_cn: $GIT_DIR/branches 目录中的文件。

source: a file in the $GIT_DIR/remotes directory, or
zh_cn: $GIT_DIR/remotes 目录中的文件，或

source: a remote in the Git configuration file: $GIT_DIR/config,
zh_cn: Git 配置文件$GIT_DIR/config 中的一个远程： ，

source: a valid head name (i.e. a refs/heads/<head> reference).
zh_cn: 有效的头名称(即一个 refs/heads/<head> 引用)。

source: a valid tag name (i.e. a refs/tags/<tag> reference).
zh_cn: 有效的标签名称(即一个 refs/tags/<tag> 引用)。

source: add everything under the current directory.
zh_cn: 添加当前目录下的所有内容。

source: added content
zh_cn: 添加的内容

source: adding context (" ") or removal ("-") lines
zh_cn: 添加上下文 (" ") 或删除(“ - ”)行

source: amend the previous commit, adding all your new changes, using your original message.
zh_cn: 修改先前的提交，添加所有新的更改，使用您的原始消息。

source: and bundle topic branches still cooking.
zh_cn: 并捆绑主题分支仍在 cooking。

source: and email them.
zh_cn: 并发送电子邮件。

source: and then untar the new code in the working tree.
zh_cn: 然后解除工作树中的新代码。

source: any path matches itself
zh_cn: 任何路径都匹配自己

source: apply them, interactively, with your sign-offs.
zh_cn: 交互地应用它们,带你的签名。

source: are files GIT_EXTERNAL_DIFF can use to read the contents of <old|new>,
zh_cn: 是文件 GIT_EXTERNAL_DIFF 可以用来读取 <old|new> 的内容，

source: are the 40-hexdigit SHA-1 hashes,
zh_cn: 是 40位的十六进制 SHA-1 哈希值，

source: are the octal representation of the file modes.
zh_cn: 是文件模式的八进制表示。

source: arrange git push to push all local branches to their corresponding branch of the mothership machine.
zh_cn: 安排 git push 将所有本地分支机构推到母机的相应分支机构。

source: backport a critical fix.
zh_cn: backport 一个关键的修复。

source: but can be used to amend a merge commit.
zh_cn: 但可以用于修改合并提交。

source: by listing files as arguments to the commit command (without --interactive or --patch switch), in which case the commit will ignore changes staged in the index, and instead record the current content of the listed files (which must already be known to Git);
zh_cn: 通过将文件作为参数列出到 commit 命令(不带--interactive 或-patch 开关)，在这种情况下，提交将忽略索引中暂存的更改，而是记录列出的当前内容文件(必须被 Git 已知);

source: by using git add to incrementally "add" changes to the index before using the commit command (Note: even modified files must be "added");
zh_cn: 在使用 commit 命令之前，通过使用 git add 来增加索引中“添加”的更改(注意：修改后的文件也必须“添加”);

source: by using git rm to remove files from the working tree and the index, again before using the commit command;
zh_cn: 在使用 commit 命令之前，使用 git rm 从工作树和索引中移除文件;

source: by using the --interactive or --patch switches with the commit command to decide one by one which files or hunks should be part of the commit in addition to contents in the index, before finalizing the operation.
zh_cn: 通过使用带有 commit 命令的--interactive 或-patch 开关，在完成操作之前，除了索引中的内容之外，逐一决定哪些文件或 hunks 应该是提交的一部分。

source: by using the -a switch with the commit command to automatically "add" changes from all known files (i.e. all files that are already listed in the index) and to automatically "rm" files in the index that have been removed from the working tree, and then perform the actual commit;
zh_cn: 通过使用带有 commit 命令的 -a 开关，可以自动从所有已知文件(即所有已经在索引中列出的文件)中添加更改，并在索引中自动 “rm” 已从工作树中删除，然后执行实际提交;

source: check the branch names in an external repository (if not known).
zh_cn: 检查外部仓库中的分支名称(如果不知道)。

source: checkout a new branch mine from master.
zh_cn: 从 master 检出新分支 mine 。

source: clone sets these configuration variables by default.
zh_cn: 默认克隆设置这些配置变量。

source: combined diff format
zh_cn: 组合差异格式

source: commit everything, as you have tested, with your sign-off.
zh_cn: 提交所有东西，你已经测试过的，带你的签名。

source: create a new topic branch.
zh_cn: 创建一个新的主题分支。

source: create a private branch based on a well known (but somewhat behind) tag.
zh_cn: 根据一个众所周知的(但有些落后)的标签创建一个私人分支。

source: create a signed tag.
zh_cn: 创建一个签名的标签。

source: create topic branch as needed and apply, again with sign-offs.
zh_cn: 根据需要创建主题分支并再次应用，带签名。

source: deleting context or removal lines
zh_cn: 删除上下文或删除行

source: extract patches from your branch, relative to master,
zh_cn: 从你的分支中提取补丁，相对于 master，

source: fast-import reads a mixed command/data stream from standard input and writes one or more packfiles directly into the current repository.
zh_cn: 快速导入从标准输入读取混合命令/数据流，并将一个或多个包文件直接写入当前存储库。

source: fetch from a specific branch ALL from a specific repository and merge it.
zh_cn: 从特定的分支中获取 ALL 并将其合并。

source: forward port all changes in private2.6.14 branch to master branch without a formal "merging".
zh_cn: 转发 private2.6.14 分支的所有更改到 master 分支，而不进行正式的"合并"。

source: garbage collect leftover objects from reverted pull.
zh_cn: 垃圾回收恢复拉取后剩余的对象。

source: git - the stupid content tracker
zh_cn: git - 愚蠢的内容跟踪器（译注：官方的自我介绍而已）

source: git fetch and fast-forwards
zh_cn: git fetch 和快进

source: git-add - Add file contents to the index
zh_cn: git-add - 将文件内容添加到索引

source: git-am - Apply a series of patches from a mailbox
zh_cn: git-am - 从邮箱应用一系列补丁

source: git-apply - Apply a patch to files and/or to the index
zh_cn: git-apply - 对文件和/或索引应用补丁

source: git-archive - Create an archive of files from a named tree
zh_cn: git-archive - 从指定树创建文件的归档

source: git-bisect - Use binary search to find the commit that introduced a bug
zh_cn: git-bisect - 使用二分法来查找引入错误的提交

source: git-blame - Show what revision and author last modified each line of a file
zh_cn: git-blame - 显示文件每一行的最后一次修订版本和作者

source: git-bundle - Move objects and refs by archive
zh_cn: git-bundle - 通过归档移动对象和引用

source: git-cat-file - Provide content or type and size information for repository objects
zh_cn: git-cat-file - 提供仓库对象的内容或类型和大小信息

source: git-check-ignore - Debug gitignore / exclude files
zh_cn: git-check-ignore - 调试 gitignore / 排除文件

source: git-checkout - Switch branches or restore working tree files
zh_cn: git-checkout - 切换分支或恢复工作树文件

source: git-cherry-pick - Apply the changes introduced by some existing commits
zh_cn: git-cherry-pick - 应用一些现有提交引入的更改

source: git-clean - Remove untracked files from the working tree
zh_cn: git-clean - 从工作树中移除未跟踪的文件

source: git-clone - Clone a repository into a new directory
zh_cn: git-clone - 克隆一个仓库到新目录中

source: git-commit - Record changes to the repository
zh_cn: git-commit - 将更改记录到仓库

source: git-commit-tree - Create a new commit object
zh_cn: git-commit-tree - 创建一个新的提交对象

source: git-config - Get and set repository or global options
zh_cn: git-config - 获取和设置仓库或全局选项

source: git-count-objects - Count unpacked number of objects and their disk consumption
zh_cn: git-count-objects - 统计未打包的对象数量及其磁盘消耗

source: git-daemon - A really simple server for Git repositories
zh_cn: git-daemon - 一个非常简单的 Git 仓库服务器

source: git-describe - Describe a commit using the most recent tag reachable from it
zh_cn: git-describe - 使用可从其访问的最新标记来描述提交

source: git-diff-index - Compare a tree to the working tree or index
zh_cn: git-diff-index - 将树与工作树或索引进行比较

source: git-fast-import - Backend for fast Git data importers
zh_cn: git-fast-import - 后端快速 Git 数据导入

source: git-fetch - Download objects and refs from another repository
zh_cn: git-fetch - 从另一个仓库下载对象和引用

source: git-filter-branch - Rewrite branches
zh_cn: git-filter-branch - 重写分支

source: git-for-each-ref - Output information on each ref
zh_cn: git-for-each-ref - 输出每个引用的信息

source: git-format-patch - Prepare patches for e-mail submission
zh_cn: git-format-patch - 准备补丁以提交电子邮件

source: git-fsck - Verifies the connectivity and validity of the objects in the database
zh_cn: git-fsck - 校验数据库中对象的连接性和有效性

source: git-gc - Cleanup unnecessary files and optimize the local repository
zh_cn: git-gc - 清理不必要的文件并优化本地仓库

source: git-grep - Print lines matching a pattern
zh_cn: git-grep - 打印匹配正则的行

source: git-hash-object - Compute object ID and optionally creates a blob from a file
zh_cn: git-hash-object - 计算对象 ID，并可选择从文件创建一个 blob

source: git-help - Display help information about Git
zh_cn: 显示有关 Git 的帮助信息

source: git-init - Create an empty Git repository or reinitialize an existing one
zh_cn: git-init - 创建一个空的 Git 仓库或重新初始化一个现有的仓库

source: git-instaweb - Instantly browse your working repository in gitweb
zh_cn: git-instaweb - 在 gitweb 中即时浏览您的工作仓库

source: git-log - Show commit logs
zh_cn: git-log - 显示提交日志。

source: git-ls-files - Show information about files in the index and the working tree
zh_cn: git-ls-files - 显示索引和工作树中的文件信息

source: git-merge - Join two or more development histories together
zh_cn: git-merge - 合并两个或多个开发历史

source: git-merge-base - Find as good common ancestors as possible for a merge
zh_cn: git-merge-base - 找到尽可能好的共同祖先进行合并

source: git-mergetool - Run merge conflict resolution tools to resolve merge conflicts
zh_cn: git-mergetool - 运行合并冲突解决工具来解决合并冲突

source: git-mv - Move or rename a file, a directory, or a symlink
zh_cn: git-mv - 移动或重命名文件，目录或符号链接

source: git-pull - Fetch from and integrate with another repository or a local branch
zh_cn: git-pull - 从另一个仓库或本地分支抓取并集成

source: git-push - Update remote refs along with associated objects
zh_cn: git-push - 更新远程引用以及关联的对象

source: git-read-tree - Reads tree information into the index
zh_cn: git-read-tree - 将树信息读入索引

source: git-rebase - Reapply commits on top of another base tip
zh_cn: git-rebase - 将提交重新应用于另一个的尖端上

source: git-reflog - Manage reflog information
zh_cn: git-reflog - 管理 reflog 信息

source: git-remote - Manage set of tracked repositories
zh_cn: git-remote - 管理一组跟踪的仓库

source: git-request-pull - Generates a summary of pending changes
zh_cn: git-request-pull - 生成待更改的摘要

source: git-rev-list - Lists commit objects in reverse chronological order
zh_cn: git-rev-list - 以反时间顺序列出提交对象

source: git-rev-parse - Pick out and massage parameters
zh_cn: git-rev-parse - 挑选和 massage 参数

source: git-revert - Revert some existing commits
zh_cn: git-revert - 恢复一些现有的提交

source: git-rm - Remove files from the working tree and from the index
zh_cn: git-rm - 从工作树和索引中移除文件

source: git-send-email - Send a collection of patches as emails
zh_cn: git-send-email - 发送一组补丁作为电子邮件

source: git-show - Show various types of objects
zh_cn: git-show - 显示各种类型的对象

source: git-show-ref - List references in a local repository
zh_cn: git-show-ref - 列出本地仓库中的引用

source: git-stash - Stash the changes in a dirty working directory away
zh_cn: git-stash - 把脏工作目录中的更改暂存

source: git-submodule - Initialize, update or inspect submodules
zh_cn: git-submodule - 初始化，更新或检查子模块

source: git-svn - Bidirectional operation between a Subversion repository and Git
zh_cn: git-svn - Subversion 仓库和 Git 之间的双向操作

source: git-symbolic-ref - Read, modify and delete symbolic refs
zh_cn: git-symbolic-ref - 阅读，修改和删除符号引用

source: git-tag - Create, list, delete or verify a tag object signed with GPG
zh_cn: git-tag - 创建，列出，删除或使用 GPG 签名检验标签对象

source: git-update-index - Register file contents in the working tree to the index
zh_cn: git-update-index - 将工作树中的文件内容注册到索引

source: git-update-ref - Update the object name stored in a ref safely
zh_cn: git-update-ref - 安全地更新存储在 ref 中的对象名

source: git-update-server-info - Update auxiliary info file to help dumb servers
zh_cn: git-update-server-info - 更新辅助信息文件以帮助哑服务器

source: git-verify-pack - Validate packed Git archive files
zh_cn: git-verify-pack - 验证打包的 Git 归档文件

source: git-write-tree - Create a tree object from the current index
zh_cn: git-write-tree - 从当前索引创建树对象

source: gitattributes - defining attributes per path
zh_cn: gitattributes - 定义每个路径的属性

source: giteveryday - A useful minimum set of commands for Everyday Git
zh_cn: giteveryday - 一组 Git 日常使用的最小有用命令集

source: gitglossary - A Git Glossary
zh_cn: gitglossary - Git 词汇表

source: gitignore - Specifies intentionally untracked files to ignore
zh_cn: gitignore - 指定有意忽略的未跟踪文件

source: gitmodules - defining submodule properties
zh_cn: gitmodules - 定义子模块属性

source: gitrevisions - specifying revisions and ranges for Git
zh_cn: gitrevisions - 指定 Git 的修订版本和范围

source: gittutorial - A tutorial introduction to Git
zh_cn: gittutorial - Git 的教程介绍

source: gitworkflows - An overview of recommended workflows with Git
zh_cn: gitworkflows - Git 推荐的工作流程概述

source: help add structured information into commit messages
zh_cn: 帮助将结构化信息添加到提交消息中

source: i.e. stash@{0}, otherwise <stash> must be a valid stash log reference of the form stash@{<revision>}.
zh_cn: 即 stash@{0} ，否则 <stash> 必须是 stash@{<revision>} 形式的的有效的储藏日志引用。

source: immediately after pulling, look at the changes done upstream since last time we checked, only in the area we are interested in.
zh_cn: 拉取后，看看上次修改后的更改，只在我们感兴趣的地区。

source: indicates the head of the current branch.
zh_cn: 表示当前分支的头部。

source: look at all your changes including the previous commit.
zh_cn: 查看所有更改，包括以前的提交。

source: make a lightweight, unannotated tag.
zh_cn: 制作一个轻量级，未注释的标签。

source: merge a topic branch into your master branch.
zh_cn: 将主题分支合并到主分支中。

source: modified content
zh_cn: 修改的内容

source: modifying existing content
zh_cn: 修改现有内容

source: modifying the contents of context or removal lines
zh_cn: 修改上下文或删除行的内容

source: mothership machine has a frotz repository under your home directory; clone from it to start a repository on the satellite machine.
zh_cn: 母机在您的主目录下有一个 frotz 仓库;从它克隆，以在卫星机器上启动一个仓库。

source: new content
zh_cn: 新内容

source: no section or name was provided (ret=2),
zh_cn: 没有提供 section 或名称(ret = 2)，

source: on mothership machine, merge the work done on the satellite machine into the master branch.
zh_cn: 在母机上，将卫星机上完成的工作合并到主分公司。

source: or:
zh_cn: 或：

source: other
zh_cn: 其他

source: push will stash all our work away on remotes/satellite/* remote-tracking branches on the mothership machine.
zh_cn: 推送将把我们所有的工作储藏在母机上的远程跟踪分支机构的 remotes/satellite/* 上。

source: read mails, save ones that are applicable, and save others that are not quite ready (other mail readers are available).
zh_cn: 阅读邮件，保存适用的邮件，并保存其他尚未准备好的邮件(其他邮件阅读器可用)。

source: rebase internal topic branch that has not been merged to the master or exposed as a part of a stable branch.
zh_cn: rebase 内部主题分支尚未合并到主分支或暴露作为稳定分支的一部分。

source: removed content
zh_cn: 移除的内容

source: removing untouched content
zh_cn: 删除未触及的内容

source: repeat as needed.
zh_cn: 根据需要重复。

source: restart pu every time from the next.
zh_cn: 每次从下一次重启 pu 。

source: restore hello.c from the index
zh_cn: 从索引中恢复 hello.c

source: return to master, ready to see what’s new
zh_cn: 返回到 master ，准备看看新功能

source: revert the pull.
zh_cn: 恢复拉取。

source: revert your botched changes in curses/ux_audio_oss.c.
zh_cn: 恢复您在 curses/ux_audio_oss.c 中的变更。

source: review commit logs; other forms to limit output can be combined and include -10 (to show up to 10 commits), --until=2005-12-10, etc.
zh_cn: 查看提交日志;可以组合限制输出的其他形式，包括 -10 (最多显示10个提交)， --until=2005-12-10 等。

source: see git-commit-tree[1]
zh_cn: 参见 git-commit-tree[1]

source: see what you were in the middle of doing, if anything.
zh_cn: 看看你在做什么，如果有什么。

source: see which branches haven’t been merged into master yet.
zh_cn: 看哪些分支尚未合并到 master 。

source: switch branch
zh_cn: 切换分支

source: switch to the master branch.
zh_cn: 切换到主分支。

source: take a file out of another commit
zh_cn: 从另一个提交中取出一个文件

source: that is to say, the branch is not reset/created unless "git checkout" is successful.
zh_cn: 也就是说，除非"git checkout"成功，否则该分支不会重置/创建。

source: the config file cannot be written (ret=4),
zh_cn: 配置文件无法写入(ret = 4)，

source: the config file is invalid (ret=3),
zh_cn: 配置文件无效(ret = 3)，

source: the pathspec up to the last slash represents a directory prefix.
zh_cn: 到最后一个斜线的路径表示一个目录前缀。

source: the rest of the pathspec is a pattern for the remainder of the pathname.
zh_cn: pathspec 的其余部分是路径名的其余部分的模式。

source: then the command
zh_cn: 然后命令

source: this second commit would record the changes to hello.c and hello.h as expected.
zh_cn: 这个第二个提交将按照预期记录 hello.c 和 hello.h 的更改。

source: to see what changes you are committing.
zh_cn: 看看你正在做什么改变。

source: view only the changes that touch what’s in curses/ directory, since v2.43 tag.
zh_cn: 只查看触及 curses/ 目录中的内容的更改，从 v2.43 标签开始。

source: where:
zh_cn: 其中:

source: will result in:
zh_cn: 将导致：

source: would be:
zh_cn: 将会是：

source: would result in the removal of commits F and G:
zh_cn: 将导致提交 F 和 G 的删除：

source: would result in:
zh_cn: 将导致：

source: y - stage this hunk n - do not stage this hunk q - quit; do not stage this hunk or any of the remaining ones a - stage this hunk and all later hunks in the file d - do not stage this hunk or any of the later hunks in the file g - select a hunk to go to / - search for a hunk matching the given regex j - leave this hunk undecided, see next undecided hunk J - leave this hunk undecided, see next hunk k - leave this hunk undecided, see previous undecided hunk K - leave this hunk undecided, see previous hunk s - split the current hunk into smaller hunks e - manually edit the current hunk ?
zh_cn: y - 暂存该块 n - 不暂存该块 q - quit; 不暂存该块或任何剩下的 a - 暂存该块及文件中所有以后的 d - 不暂存该块或后续文件中的任何块 g - 选择一个块以继续 / - 搜索匹配给定正则表达式的一个块 j - 离开该块暂不决定，查看下一个未决定的块 J - 离开该块暂不决定，查看下一个块 k - 离开该块暂不决定，查看上一个未决定的块 K - 离开该块暂不决定，查看上一个块 s - 分割当前块为更小的块 e - 手动编辑当前块 ?

source: you need to tell Git if you added a new file; removal and modification will be caught if you do git commit -a later.
zh_cn: 你需要告诉 Git 是否添加了一个新的文件;如果您稍后执行 git commit -a ，将会抓住删除和修改。

source: you try to unset an option which does not exist (ret=5),
zh_cn: 您尝试取消设置不存在的选项(ret = 5)，

source: you try to unset/set an option for which multiple lines match (ret=5), or
zh_cn: 您尝试取消设置/设置的选项有多个行匹配(ret = 5)，或

source: you try to use an invalid regexp (ret=6).
zh_cn: 您尝试使用无效的正则表达式(ret = 6)。
